In [6]:
import pandas as pd

In [7]:
Location = "datasets/axisdata.xlsx"

In [8]:
df =pd.read_excel(Location)

In [74]:
df.head()

,Fname,Lname,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
0,Jada,Walters,F,39,N,3,2
1,Nicole,Henderson,F,46,N,3,6
2,Tanya,Moore,F,42,Y,4,6
3,Ronelle,Jackson,F,38,Y,5,3
4,Brad,Sears,M,33,N,4,2

In [75]:
# Question (a)
print("The average number of cars sold per month is:")
df['Cars Sold'].mean()

The average number of cars sold per month is:

3.9229229229229228

In [76]:
#Question (b)
print("The maximum number cars sold per month is:")
df['Cars Sold'].max()

The maximum number cars sold per month is:

7

In [77]:
#Question (c)
print("The minimum number cars sold per month is:")
df['Cars Sold'].min()

The minimum number cars sold per month is:

1

In [78]:
# Grouping by gender for question (d)
groupby_gender = df['Years Experience'].groupby(df['Cars Sold'])
groupby_gender

In [79]:
print("The average number cars sold by gender is:")
df['Cars Sold'].groupby(df['Gender']).mean()

The average number cars sold by gender is:

Gender
F    3.760736
M    4.078431
Name: Cars Sold, dtype: float64

In [69]:
# Question (f)
print("The average years of experience is:")
df['Years Experience'].mean()

The average years of experience is:

3.026026026026026

In [26]:
# Grouping by +/- training question (h)

groupby_SalesTraining = df['SalesTraining'].groupby(df['Cars Sold'])
groupby_SalesTraining

In [27]:
print("The average number cars sold by training experience is:")
df['Cars Sold'].groupby(df['SalesTraining']).mean()

The average number cars sold by training experience is:

SalesTraining
N    3.573850
Y    4.168942
Name: Cars Sold, dtype: float64

In [28]:
# Binning by less than 3 or greater than equal 3 cars sold for questions e, g
bins = [0, 3, 8]

In [29]:
group_names = ['< 3', '>=3']

In [30]:
df ['sold'] = pd.cut(df['Cars Sold'], bins, labels =group_names)

In [16]:
df.head()

,Fname,Lname,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold,sold
0,Jada,Walters,F,39,N,3,2,< 3
1,Nicole,Henderson,F,46,N,3,6,>=3
2,Tanya,Moore,F,42,Y,4,6,>=3
3,Ronelle,Jackson,F,38,Y,5,3,< 3
4,Brad,Sears,M,33,N,4,2,< 3

In [31]:
# Grouping by avg hrs worked people selling >= 3 cars sold question (e)
groupby_sold = df['sold'].groupby(df['Hours Worked'])
groupby_sold

In [33]:
# Do not know how to answer this question for only the >=3 cars sold bin
print("The average number of hours worked binned by number of cars sold:")
df['Hours Worked'].groupby(df['sold']).mean()

The average number of hours worked binned by number of cars sold:

sold
< 3    32.273171
>=3    34.740238
Name: Hours Worked, dtype: float64

In [34]:
# Grouping by avg hrs worked people selling >= 3 cars sold question (g)
groupby_sold = df['sold'].groupby(df['Years Experience'])
groupby_sold

In [35]:
# Do not know how to answer this question for only the >=3 cars sold bin
print("The average years of experience binned by number of cars sold:")
df['Years Experience'].groupby(df['sold']).mean()

The average years of experience binned by number of cars sold:

sold
< 3    2.992683
>=3    3.049236
Name: Years Experience, dtype: float64

In [ ]:
# Question h:  The best indicator of a good salesperson appears to be Sales Training as those with training
# sell ~0.6 more cars per month more than those without training.  There also may be a gender difference as males
# sell ~0.3 more cars per month than females.  Hours worked and years of experience seem to have less of an effect
# although binning by experience or hours worked and finding average number of cars sold for each bin might uncover a tipping point
# for these two variables and their role in average number of cars sold.